/* 一个程序，接受一个整数输入，然后显示所有小于或等于该数的素数。
 *
 * 质数、素数、约数、合数、因数有什么区别?
 * 质数,也称素数,即只能被1和它本身整除的正整数.如2,3,5,7等,2是唯一的偶数质数.
 * 合数与之相反,除1和它本身之外,至少还有1个数能够整除它.如4,9,12等.
 * 如果一个数能整除另一个数,则这个数称为另一个数的约数,也可以说是它的因数.
 * 上述概念,一般是在正整数范围内研究.
 *
 * 对比1大比自己小求余不等于0的就是素数
 */
#include <stdio.h>

int main()
{
    long num,zs=0;
    printf("请输入一个正整数的值，将打印出比他小的素数：");
    while(scanf("%lu", &num) == 1)  //检查数值正确性
    {
        for(long i =1; i <= num; i++)  //比他小的每一个值送到下个循环检查一遍是否是素数
        {
            for(long j=2; j<i; j++)  //检查这个值是不是素数
            {
                if(i%j == 0)
                    zs++;
            }
            if(zs > 0)                  //是素数就打印出来

                 ;//printf("%lu这是合数！\n", i);
            else
                printf("%3lu ", i);
            zs=0;
        }
    }
    return 0;
}
